heatSolverFEniCSx_OpenFOAM/caseC/fluid/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleEnthalpy;

}

mixture
{
    specie
    {
        molWeight       22.7096;
    }
    equationOfState
    {
        rho0            240;
        T0              273.15;
        beta            0.01;
    }
    thermodynamics
    {
        Cp              175;
        Hf              0;
    }
    transport
    {           
        mu              0.8;//0.001;

        
        Pr              7.0;


    }
}
// ************************************************************************* //
